Any updates on this issue? Facing same issue, the first plan shows that the edge host will be created, but subsequent property resource fails to create as the hostname take sometime for edge hostname to move from `Change Request` status to `active` status. Once, edge hostname is active and running plan again forces replacement some random edgehost with the required hostname. 

```
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # akamai_edge_hostname.this["example.com"] must be replaced
-/+ resource "akamai_edge_hostname" "this" {
      ~ contract      = "ctr_" -> (known after apply)
      ~ edge_hostname = "random.com.edgesuite.net" -> "example.com.edgekey.net" # forces replacement
      ~ group         = "grp_" -> (known after apply)
      ~ id            = "ehn_" -> (known after apply)
      ~ product       = "prd_" -> (known after apply)
        # (5 unchanged attributes hidden)
    }
```